
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>编译 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="symbol_table.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="./">
            
                <a href="./">
            
                    
                    二进制基础
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.2.1" data-path="complie.html">
            
                <a href="complie.html">
            
                    
                    编译
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="symbol_table.html">
            
                <a href="symbol_table.html">
            
                    
                    符号表
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../embedding/">
            
                <a href="../embedding/">
            
                    
                    编码
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../embedding/raw_byte.html">
            
                <a href="../embedding/raw_byte.html">
            
                    
                    原始字节编码
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../embedding/disassembled_instruction_manual.html">
            
                <a href="../embedding/disassembled_instruction_manual.html">
            
                    
                    反汇编指令的人工编码
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../embedding/learning-base.html">
            
                <a href="../embedding/learning-base.html">
            
                    
                    基于学习的编码
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >编译</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7F16;&#x8BD1;">&#x7F16;&#x8BD1;</h1>
<h5 id=""> </h5>
<h2 id="&#x94FE;&#x63A5;">&#x94FE;&#x63A5;</h2>
<h4 id="&#x9759;&#x6001;&#x94FE;&#x63A5;">&#x9759;&#x6001;&#x94FE;&#x63A5;</h4>
<h5 id="&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x8FDB;&#x884C;&#x9759;&#x6001;&#x94FE;&#x63A5;">&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x8FDB;&#x884C;&#x9759;&#x6001;&#x94FE;&#x63A5;</h5>
<blockquote>
<p>&#x5728;&#x6211;&#x4EEC;&#x7684;&#x5B9E;&#x9645;&#x5F00;&#x53D1;&#x4E2D;&#xFF0C;&#x4E0D;&#x53EF;&#x80FD;&#x5C06;&#x6240;&#x6709;&#x4EE3;&#x7801;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x6E90;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x6240;&#x4EE5;&#x4F1A;&#x51FA;&#x73B0;&#x591A;&#x4E2A;&#x6E90;&#x6587;&#x4EF6;&#xFF0C;&#x800C;&#x4E14;&#x591A;&#x4E2A;&#x6E90;&#x6587;&#x4EF6;&#x4E4B;&#x95F4;&#x4E0D;&#x662F;&#x72EC;&#x7ACB;&#x7684;&#xFF0C;&#x800C;&#x4F1A;&#x5B58;&#x5728;&#x591A;&#x79CD;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF0C;&#x5982;&#x4E00;&#x4E2A;&#x6E90;&#x6587;&#x4EF6;&#x53EF;&#x80FD;&#x8981;&#x8C03;&#x7528;&#x53E6;&#x4E00;&#x4E2A;&#x6E90;&#x6587;&#x4EF6;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x4F46;&#x662F;&#x6BCF;&#x4E2A;&#x6E90;&#x6587;&#x4EF6;&#x90FD;&#x662F;&#x72EC;&#x7ACB;&#x7F16;&#x8BD1;&#x7684;&#xFF0C;&#x5373;&#x6BCF;&#x4E2A;<em>.c&#x6587;&#x4EF6;&#x4F1A;&#x5F62;&#x6210;&#x4E00;&#x4E2A;</em>.o&#x6587;&#x4EF6;&#xFF0C;&#x4E3A;&#x4E86;&#x6EE1;&#x8DB3;&#x524D;&#x9762;&#x8BF4;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x5C06;&#x8FD9;&#x4E9B;&#x6E90;&#x6587;&#x4EF6;&#x4EA7;&#x751F;&#x7684;&#x76EE;&#x6807;&#x6587;&#x4EF6;&#x8FDB;&#x884C;&#x94FE;&#x63A5;&#xFF0C;&#x4ECE;&#x800C;&#x5F62;&#x6210;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x7684;&#x7A0B;&#x5E8F;&#x3002;&#x8FD9;&#x4E2A;&#x94FE;&#x63A5;&#x7684;&#x8FC7;&#x7A0B;&#x5C31;&#x662F;&#x9759;&#x6001;&#x94FE;&#x63A5;</p>
</blockquote>
<h5 id="&#x9759;&#x6001;&#x94FE;&#x63A5;&#x7684;&#x539F;&#x7406;">&#x9759;&#x6001;&#x94FE;&#x63A5;&#x7684;&#x539F;&#x7406;</h5>
<blockquote>
<p>&#x7531;&#x5F88;&#x591A;&#x76EE;&#x6807;&#x6587;&#x4EF6;&#x8FDB;&#x884C;&#x94FE;&#x63A5;&#x5F62;&#x6210;&#x7684;&#x662F;&#x9759;&#x6001;&#x5E93;&#xFF0C;&#x53CD;&#x4E4B;&#x9759;&#x6001;&#x5E93;&#x4E5F;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5730;&#x770B;&#x6210;&#x662F;&#x4E00;&#x7EC4;&#x76EE;&#x6807;&#x6587;&#x4EF6;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x5373;&#x5F88;&#x591A;&#x76EE;&#x6807;&#x6587;&#x4EF6;&#x7ECF;&#x8FC7;&#x538B;&#x7F29;&#x6253;&#x5305;&#x540E;&#x5F62;&#x6210;&#x7684;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#xFF0C;&#x4F7F;&#x7528;ar&#x547D;&#x4EE4;&#x7684;-a&#x53C2;&#x6570;&#x67E5;&#x770B;&#x9759;&#x6001;&#x5E93;&#x7684;&#x7EC4;&#x6210;&#xFF1A;</p>
<p><img src="https://raw.githubusercontent.com/AnchoretY/images/master/blog/image.c997l5eis6b.png" alt="image"></p>
<p>&#x4EE5;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x56FE;&#x6765;&#x7B80;&#x5355;&#x8BF4;&#x660E;&#x4E00;&#x4E0B;&#x4ECE;&#x9759;&#x6001;&#x94FE;&#x63A5;&#x5230;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x6839;&#x636E;&#x5728;&#x6E90;&#x6587;&#x4EF6;&#x4E2D;&#x5305;&#x542B;&#x7684;&#x5934;&#x6587;&#x4EF6;&#x548C;&#x7A0B;&#x5E8F;&#x4E2D;&#x4F7F;&#x7528;&#x5230;&#x7684;&#x5E93;&#x51FD;&#x6570;&#xFF0C;&#x5982;stdio.h&#x4E2D;&#x5B9A;&#x4E49;&#x7684;printf()&#x51FD;&#x6570;&#xFF0C;&#x5728;libc.a&#x4E2D;&#x627E;&#x5230;&#x76EE;&#x6807;&#x6587;&#x4EF6;printf.o(&#x8FD9;&#x91CC;&#x6682;&#x4E14;&#x4E0D;&#x8003;&#x8651;printf()&#x51FD;&#x6570;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;)&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#x6587;&#x4EF6;&#x548C;&#x6211;&#x4EEC;hello.o&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x8FDB;&#x884C;&#x94FE;&#x63A5;&#x5F62;&#x6210;&#x6211;&#x4EEC;&#x7684;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x3002;</p>
<p><img src="https://raw.githubusercontent.com/AnchoretY/images/master/blog/image.87su1tdp6hu.png" alt="image" style="zoom:67%;"></p>
<p>&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x4E2A;&#x5C0F;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x662F;&#x4ECE;&#x4E0A;&#x9762;&#x7684;&#x56FE;&#x4E2D;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x9759;&#x6001;&#x8FD0;&#x884C;&#x5E93;&#x91CC;&#x9762;&#x7684;&#x4E00;&#x4E2A;&#x76EE;&#x6807;&#x6587;&#x4EF6;&#x53EA;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x5982;libc.a&#x91CC;&#x9762;&#x7684;printf.o&#x53EA;&#x6709;printf()&#x51FD;&#x6570;&#xFF0C;strlen.o&#x91CC;&#x9762;&#x53EA;&#x6709;strlen()&#x51FD;&#x6570;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;<strong>&#x94FE;&#x63A5;&#x5668;&#x5728;&#x94FE;&#x63A5;&#x9759;&#x6001;&#x94FE;&#x63A5;&#x5E93;&#x7684;&#x65F6;&#x5019;&#x662F;&#x4EE5;&#x76EE;&#x6807;&#x6587;&#x4EF6;&#x4E3A;&#x5355;&#x4F4D;&#x7684;</strong>&#x3002;&#x6BD4;&#x5982;&#x6211;&#x4EEC;&#x5F15;&#x7528;&#x4E86;&#x9759;&#x6001;&#x5E93;&#x4E2D;&#x7684;printf()&#x51FD;&#x6570;&#xFF0C;&#x90A3;&#x4E48;&#x94FE;&#x63A5;&#x5668;&#x5C31;&#x4F1A;&#x628A;&#x5E93;&#x4E2D;&#x5305;&#x542B;printf()&#x51FD;&#x6570;&#x7684;&#x90A3;&#x4E2A;&#x76EE;&#x6807;&#x6587;&#x4EF6;&#x94FE;&#x63A5;&#x8FDB;&#x6765;&#xFF0C;<strong>&#x5982;&#x679C;&#x5F88;&#x591A;&#x51FD;&#x6570;&#x90FD;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x76EE;&#x6807;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x5F88;&#x53EF;&#x80FD;&#x5F88;&#x591A;&#x6CA1;&#x7528;&#x7684;&#x51FD;&#x6570;&#x90FD;&#x88AB;&#x4E00;&#x8D77;&#x94FE;&#x63A5;&#x8FDB;&#x4E86;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x4E2D;</strong>&#x3002;&#x7531;&#x4E8E;&#x8FD0;&#x884C;&#x5E93;&#x6709;&#x6210;&#x767E;&#x4E0A;&#x5343;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x6570;&#x91CF;&#x975E;&#x5E38;&#x5E9E;&#x5927;&#xFF0C;&#x6BCF;&#x4E2A;&#x51FD;&#x6570;&#x72EC;&#x7ACB;&#x5730;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x76EE;&#x6807;&#x6587;&#x4EF6;&#x4E2D;&#x53EF;&#x4EE5;&#x5C3D;&#x91CF;&#x51CF;&#x5C11;&#x7A7A;&#x95F4;&#x7684;&#x6D6A;&#x8D39;&#xFF0C;&#x90A3;&#x4E9B;&#x6CA1;&#x6709;&#x88AB;&#x7528;&#x5230;&#x7684;&#x76EE;&#x6807;&#x6587;&#x4EF6;&#x5C31;&#x4E0D;&#x8981;&#x94FE;&#x63A5;&#x5230;&#x6700;&#x7EC8;&#x7684;&#x8F93;&#x51FA;&#x6587;&#x4EF6;&#x4E2D;&#x3002;</p>
</blockquote>
<h5 id="&#x9759;&#x6001;&#x94FE;&#x63A5;&#x7684;&#x4F18;&#x7F3A;&#x70B9;">&#x9759;&#x6001;&#x94FE;&#x63A5;&#x7684;&#x4F18;&#x7F3A;&#x70B9;</h5>
<blockquote>
<p><strong>&#x4F18;&#x52BF;</strong>&#xFF1A;&#x5728;&#x53EF;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x4E2D;&#x5DF2;&#x7ECF;&#x5177;&#x5907;&#x4E86;&#x6240;&#x6709;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x6240;&#x9700;&#x8981;&#x7684;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#xFF0C;&#x5728;&#x6267;&#x884C;&#x7684;&#x65F6;&#x5019;&#x8FD0;&#x884C;&#x901F;&#x5EA6;&#x5FEB;&#x3002;</p>
<p><strong>&#x7F3A;&#x70B9;</strong>&#xFF1A;</p>
<ul>
<li>&#x6D6A;&#x8D39;&#x7A7A;&#x95F4;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x4E2A;&#x53EF;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x4E2D;&#x5BF9;&#x6240;&#x6709;&#x9700;&#x8981;&#x7684;&#x76EE;&#x6807;&#x6587;&#x4EF6;&#x90FD;&#x8981;&#x6709;&#x4E00;&#x4EFD;&#x526F;&#x672C;&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x591A;&#x4E2A;&#x7A0B;&#x5E8F;&#x5BF9;&#x540C;&#x4E00;&#x4E2A;&#x76EE;&#x6807;&#x6587;&#x4EF6;&#x90FD;&#x6709;&#x4F9D;&#x8D56;&#xFF0C;&#x5982;&#x591A;&#x4E2A;&#x7A0B;&#x5E8F;&#x4E2D;&#x90FD;&#x8C03;&#x7528;&#x4E86;printf()&#x51FD;&#x6570;&#xFF0C;&#x5219;&#x8FD9;&#x591A;&#x4E2A;&#x7A0B;&#x5E8F;&#x4E2D;&#x90FD;&#x542B;&#x6709;printf.o&#xFF0C;&#x6240;&#x4EE5;&#x540C;&#x4E00;&#x4E2A;&#x76EE;&#x6807;&#x6587;&#x4EF6;&#x90FD;&#x5728;&#x5185;&#x5B58;&#x5B58;&#x5728;&#x591A;&#x4E2A;&#x526F;&#x672C;&#xFF1B;</li>
<li>&#x66F4;&#x65B0;&#x56F0;&#x96BE;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x5F53;&#x5E93;&#x51FD;&#x6570;&#x7684;&#x4EE3;&#x7801;&#x4FEE;&#x6539;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5C31;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x8FDB;&#x884C;&#x7F16;&#x8BD1;&#x94FE;&#x63A5;&#x5F62;&#x6210;&#x53EF;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x3002;</li>
</ul>
</blockquote>
<h4 id="&#x52A8;&#x6001;&#x94FE;&#x63A5;">&#x52A8;&#x6001;&#x94FE;&#x63A5;</h4>
<h5 id="&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x51FA;&#x73B0;&#x52A8;&#x6001;&#x94FE;&#x63A5;">&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x51FA;&#x73B0;&#x52A8;&#x6001;&#x94FE;&#x63A5;</h5>
<blockquote>
<p>&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x9759;&#x6001;&#x94FE;&#x63A5;&#x7684;&#x7A7A;&#x95F4;&#x6D6A;&#x8D39;&#x548C;&#x66F4;&#x65B0;&#x56F0;&#x96BE;&#x7684;&#x95EE;&#x9898;</p>
</blockquote>
<h5 id="&#x52A8;&#x6001;&#x94FE;&#x63A5;&#x7684;&#x539F;&#x7406;">&#x52A8;&#x6001;&#x94FE;&#x63A5;&#x7684;&#x539F;&#x7406;</h5>
<blockquote>
<p><strong>&#x57FA;&#x672C;&#x601D;&#x60F3;</strong>:&#x628A;&#x7A0B;&#x5E8F;&#x6309;&#x7167;&#x6A21;&#x5757;&#x62C6;&#x5206;&#x6210;&#x5404;&#x4E2A;&#x76F8;&#x5BF9;&#x72EC;&#x7ACB;&#x90E8;&#x5206;&#xFF0C;&#x5728;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x65F6;&#x624D;&#x5C06;&#x5B83;&#x4EEC;&#x94FE;&#x63A5;&#x5728;&#x4E00;&#x8D77;&#x5F62;&#x6210;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x50CF;&#x9759;&#x6001;&#x94FE;&#x63A5;&#x4E00;&#x6837;&#x628A;&#x6240;&#x6709;&#x7A0B;&#x5E8F;&#x6A21;&#x5757;&#x90FD;&#x94FE;&#x63A5;&#x6210;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x7B80;&#x5355;&#x4ECB;&#x7ECD;&#x52A8;&#x6001;&#x94FE;&#x63A5;&#x7684;&#x8FC7;&#x7A0B;&#xFF1A;</p>
<p>&#x200B;    &#x5047;&#x8BBE;&#x73B0;&#x5728;&#x6709;&#x4E24;&#x4E2A;&#x7A0B;&#x5E8F;program1.o&#x548C;program2.o&#xFF0C;&#x8FD9;&#x4E24;&#x8005;&#x5171;&#x7528;&#x540C;&#x4E00;&#x4E2A;&#x5E93;lib.o,&#x5047;&#x8BBE;&#x9996;&#x5148;&#x8FD0;&#x884C;&#x7A0B;&#x5E8F;program1&#xFF0C;&#x7CFB;&#x7EDF;&#x9996;&#x5148;&#x52A0;&#x8F7D;program1.o&#xFF0C;&#x5F53;&#x7CFB;&#x7EDF;&#x53D1;&#x73B0;program1.o&#x4E2D;&#x7528;&#x5230;&#x4E86;lib.o&#xFF0C;&#x5373;program1.o&#x4F9D;&#x8D56;&#x4E8E;lib.o&#xFF0C;&#x90A3;&#x4E48;&#x7CFB;&#x7EDF;&#x63A5;&#x7740;&#x52A0;&#x8F7D;lib.o&#xFF0C;&#x5982;&#x679C;program1.o&#x548C;lib.o&#x8FD8;&#x4F9D;&#x8D56;&#x4E8E;&#x5176;&#x4ED6;&#x76EE;&#x6807;&#x6587;&#x4EF6;&#xFF0C;&#x5219;&#x4F9D;&#x6B21;&#x5168;&#x90E8;&#x52A0;&#x8F7D;&#x5230;&#x5185;&#x5B58;&#x4E2D;&#x3002;&#x5F53;program2&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x540C;&#x6837;&#x7684;&#x52A0;&#x8F7D;program2.o&#xFF0C;&#x7136;&#x540E;&#x53D1;&#x73B0;program2.o&#x4F9D;&#x8D56;&#x4E8E;lib.o&#xFF0C;&#x4F46;&#x662F;&#x6B64;&#x65F6;lib.o&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x4E8E;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5C31;&#x4E0D;&#x518D;&#x8FDB;&#x884C;&#x91CD;&#x65B0;&#x52A0;&#x8F7D;&#xFF0C;&#x800C;&#x662F;&#x5C06;&#x5185;&#x5B58;&#x4E2D;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x7684;lib.o&#x6620;&#x5C04;&#x5230;program2&#x7684;&#x865A;&#x62DF;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x4E2D;&#xFF0C;&#x4ECE;&#x800C;&#x8FDB;&#x884C;&#x94FE;&#x63A5;&#xFF08;&#x8FD9;&#x4E2A;&#x94FE;&#x63A5;&#x8FC7;&#x7A0B;&#x548C;&#x9759;&#x6001;&#x94FE;&#x63A5;&#x7C7B;&#x4F3C;&#xFF09;&#x5F62;&#x6210;&#x53EF;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x3002;</p>
</blockquote>
<h4 id="&#x52A8;&#x6001;&#x94FE;&#x63A5;&#x7684;&#x4F18;&#x7F3A;&#x70B9;">&#x52A8;&#x6001;&#x94FE;&#x63A5;&#x7684;&#x4F18;&#x7F3A;&#x70B9;</h4>
<blockquote>
<p><strong>&#x4F18;&#x70B9;</strong>&#xFF1A;</p>
<ul>
<li>&#x5C31;&#x662F;&#x5373;&#x4F7F;&#x9700;&#x8981;&#x6BCF;&#x4E2A;&#x7A0B;&#x5E8F;&#x90FD;&#x4F9D;&#x8D56;&#x540C;&#x4E00;&#x4E2A;&#x5E93;&#xFF0C;&#x4F46;&#x662F;&#x8BE5;&#x5E93;&#x4E0D;&#x4F1A;&#x50CF;&#x9759;&#x6001;&#x94FE;&#x63A5;&#x90A3;&#x6837;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x5B58;&#x5728;&#x591A;&#x5206;&#xFF0C;&#x526F;&#x672C;&#xFF0C;&#x800C;&#x662F;&#x8FD9;&#x591A;&#x4E2A;&#x7A0B;&#x5E8F;&#x5728;&#x6267;&#x884C;&#x65F6;&#x5171;&#x4EAB;&#x540C;&#x4E00;&#x4EFD;&#x526F;&#x672C;&#xFF1B;</li>
<li>&#x53E6;&#x4E00;&#x4E2A;&#x4F18;&#x70B9;&#x662F;&#xFF0C;&#x66F4;&#x65B0;&#x4E5F;&#x6BD4;&#x8F83;&#x65B9;&#x4FBF;&#xFF0C;&#x66F4;&#x65B0;&#x65F6;&#x53EA;&#x9700;&#x8981;&#x66FF;&#x6362;&#x539F;&#x6765;&#x7684;&#x76EE;&#x6807;&#x6587;&#x4EF6;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x5C06;&#x6240;&#x6709;&#x7684;&#x7A0B;&#x5E8F;&#x518D;&#x91CD;&#x65B0;&#x94FE;&#x63A5;&#x4E00;&#x904D;&#x3002;&#x5F53;&#x7A0B;&#x5E8F;&#x4E0B;&#x4E00;&#x6B21;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x65B0;&#x7248;&#x672C;&#x7684;&#x76EE;&#x6807;&#x6587;&#x4EF6;&#x4F1A;&#x88AB;&#x81EA;&#x52A8;&#x52A0;&#x8F7D;&#x5230;&#x5185;&#x5B58;&#x5E76;&#x4E14;&#x94FE;&#x63A5;&#x8D77;&#x6765;&#xFF0C;&#x7A0B;&#x5E8F;&#x5C31;&#x5B8C;&#x6210;&#x4E86;&#x5347;&#x7EA7;&#x7684;&#x76EE;&#x6807;&#x3002;</li>
</ul>
<p><strong>&#x7F3A;&#x70B9;</strong>&#xFF1A;&#x6027;&#x80FD;&#x5B58;&#x5728;&#x4E00;&#x5B9A;&#x7684;&#x635F;&#x5931;&#xFF0C;&#x56E0;&#x4E3A;&#x628A;&#x94FE;&#x63A5;&#x63A8;&#x8FDF;&#x5230;&#x4E86;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x6240;&#x4EE5;&#x6BCF;&#x6B21;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x90FD;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x94FE;&#x63A5;&#x3002;</p>
</blockquote>
<h5 id="&#x52A8;&#x6001;&#x94FE;&#x63A5;&#x5730;&#x5740;&#x662F;&#x5982;&#x4F55;&#x91CD;&#x5B9A;&#x4F4D;&#x7684;&#x5462;&#xFF1F;">&#x52A8;&#x6001;&#x94FE;&#x63A5;&#x5730;&#x5740;&#x662F;&#x5982;&#x4F55;&#x91CD;&#x5B9A;&#x4F4D;&#x7684;&#x5462;&#xFF1F;</h5>
<blockquote>
<p>&#x867D;&#x7136;&#x52A8;&#x6001;&#x94FE;&#x63A5;&#x628A;&#x94FE;&#x63A5;&#x8FC7;&#x7A0B;&#x63A8;&#x8FDF;&#x5230;&#x4E86;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x5F62;&#x6210;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x65F6;&#xFF08;&#x6CE8;&#x610F;&#x5F62;&#x6210;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x548C;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x662F;&#x4E24;&#x4E2A;&#x6982;&#x5FF5;&#xFF09;&#xFF0C;&#x8FD8;&#x662F;&#x9700;&#x8981;&#x7528;&#x5230;&#x52A8;&#x6001;&#x94FE;&#x63A5;&#x5E93;&#x3002;&#x6BD4;&#x5982;&#x6211;&#x4EEC;&#x5728;&#x5F62;&#x6210;&#x53EF;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x65F6;&#xFF0C;&#x53D1;&#x73B0;&#x5F15;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x5916;&#x90E8;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x6B64;&#x65F6;&#x4F1A;&#x68C0;&#x67E5;&#x52A8;&#x6001;&#x94FE;&#x63A5;&#x5E93;&#xFF0C;&#x53D1;&#x73B0;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x540D;&#x662F;&#x4E00;&#x4E2A;&#x52A8;&#x6001;&#x94FE;&#x63A5;&#x7B26;&#x53F7;&#xFF0C;&#x6B64;&#x65F6;&#x53EF;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x5C31;&#x4E0D;&#x5BF9;&#x8FD9;&#x4E2A;&#x7B26;&#x53F7;&#x8FDB;&#x884C;&#x91CD;&#x5B9A;&#x4F4D;&#xFF0C;&#x800C;&#x628A;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x7559;&#x5230;&#x88C5;&#x8F7D;&#x65F6;&#x518D;&#x8FDB;&#x884C;&#x3002;</p>
</blockquote>
<h5 id="&#x9759;&#x6001;&#x94FE;&#x63A5;&#x4E0E;&#x52A8;&#x6001;&#x94FE;&#x63A5;&#x7684;&#x6700;&#x5927;&#x533A;&#x522B;">&#x9759;&#x6001;&#x94FE;&#x63A5;&#x4E0E;&#x52A8;&#x6001;&#x94FE;&#x63A5;&#x7684;&#x6700;&#x5927;&#x533A;&#x522B;</h5>
<blockquote>
<p>&#x94FE;&#x63A5;&#x65F6;&#x95F4;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;&#x9759;&#x6001;&#x94FE;&#x63A5;&#x662F;&#x5728;&#x5F62;&#x6210;&#x53EF;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x4E4B;&#x524D;&#xFF0C;&#x52A8;&#x6001;&#x94FE;&#x63A5;&#x662F;&#x5728;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x65F6;&#x8FDB;&#x884C;&#x7684;</p>
</blockquote>
<p>&#x3010;&#x53C2;&#x8003;&#x6587;&#x732E;&#x3011;</p>
<ul>
<li><a href="https://blog.csdn.net/kang___xi/article/details/80210717" target="_blank">&#x6DF1;&#x5165;&#x6D45;&#x51FA;&#x9759;&#x6001;&#x94FE;&#x63A5;&#x548C;&#x52A8;&#x6001;&#x94FE;&#x63A5;</a></li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: 二进制基础">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="symbol_table.html" class="navigation navigation-next " aria-label="Next page: 符号表">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"编译","level":"1.2.1","depth":2,"next":{"title":"符号表","level":"1.2.2","depth":2,"path":"base/symbol_table.md","ref":"./base/symbol_table.md","articles":[]},"previous":{"title":"二进制基础","level":"1.2","depth":1,"path":"base/README.md","ref":"./base/README.md","articles":[{"title":"编译","level":"1.2.1","depth":2,"path":"base/complie.md","ref":"./base/complie.md","articles":[]},{"title":"符号表","level":"1.2.2","depth":2,"path":"base/symbol_table.md","ref":"./base/symbol_table.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"base/complie.md","mtime":"2022-03-29T07:51:25.494Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-03-31T06:38:11.750Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

